Revit 2027 API
Workset Methods
The Workset type exposes the following members.
Methods
Name | Description
Create |  Creates a new workset.
Dispose
(Inherited from WorksetPreview)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Workset Class
Autodesk.Revit.DB Namespace